netify-soap/src/test/resources/soap/requests/movie/GetMovieAllRequestNoFilterTest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://mouthaan.org/namespace/netify/general">
    <soapenv:Header/>
    <soapenv:Body>
        <gen:GetMovieAllRequest/>
    </soapenv:Body>
</soapenv:Envelope>